# <font color=blue> Pandas-I 
## Ciência de Dados - Unesp
---

<img src="pandas.png" width=500 height=500>

No nível mais básico, os objetos Pandas podem ser considerados como versões aprimoradas de matrizes estruturadas NumPy nas quais as linhas e colunas são identificadas com rótulos em vez de índices inteiros simples. Como veremos no decorrer desta aula, o Pandas fornece uma série de ferramentas, métodos e funcionalidades úteis além das estruturas de dados básicas, mas quase tudo o que se segue exigirá uma compreensão do que são essas estruturas. Portanto, antes de prosseguirmos, vamos apresentar essas três estruturas de dados fundamentais do Pandas: Series, DataFrame e Index.

In [1]:
# Iniciamos importando a biblioteca do Pandas

import pandas as pd
import numpy as np

# Series

* Series são matrizes unidimensionais rotuladas capazes de armazenar dados de qualquer tipo (inteiro, string, float, objetos python, etc.). 

* Os rótulos dos eixos são chamados coletivamente de índices. 

* Fazendo um paralelo com uma planilha MS-EXCEL uma série representa uma coluna em uma planilha do Excel.

In [2]:
# Criando uma series com indice

s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
s

a    3
b   -5
c    7
d    4
dtype: int64

In [3]:
# Series com indice automático

j = pd.Series([2,4,6,8,9])
j

0    2
1    4
2    6
3    8
4    9
dtype: int64

In [4]:
s['b']

-5

In [5]:
j[0]+j[3]+j[1] / j[2]-j[4]

1.666666666666666

In [9]:
# matemática em Series

j.div(4)

0    0.50
1    1.00
2    1.50
3    2.00
4    2.25
dtype: float64

In [10]:
pd.Series({2:'a',1:'b',3:'c'})

2    a
1    b
3    c
dtype: object

In [11]:
pd.Series({2:'a',1:'b',3:'c'}, index=[3,2])

3    c
2    a
dtype: object

## Série como dicionário especializado

Dessa forma, você pode pensar em uma série Pandas um pouco como uma especialização de um dicionário Python. Um dicionário é uma estrutura que mapeia chaves arbitrárias para um conjunto de valores arbitrários, e uma série é uma estrutura que mapeia chaves digitadas para um conjunto de valores digitados. Essa digitação é importante: assim como o código compilado específico do tipo por trás de um array NumPy o torna mais eficiente do que uma lista Python para certas operações, as informações de tipo de uma série Pandas o tornam muito mais eficiente do que os dicionários Python para certas operações.

A analogia de Series como dicionário pode ser ainda mais clara construindo um objeto Series diretamente de um dicionário Python:

In [12]:
# Lista arbitrário de concentrações urbanas no Brasil por população

population_dict = {'São Paulo': 12252023,
                  'Rio de Janeiro': 6718932,
                  'Brasilia': 3015268,
                  'Salvador': 2872347,
                  'Fortaleza': 2669342}

population = pd.Series(population_dict)
population

São Paulo         12252023
Rio de Janeiro     6718932
Brasilia           3015268
Salvador           2872347
Fortaleza          2669342
dtype: int64

In [13]:
population['São Paulo']

12252023

## O objeto DataFrame do Pandas

A próxima estrutura fundamental do Pandas é o DataFrame. Como o objeto *Series* apresentado, o objeto *DataFrame* pode ser considerado uma generalização de um array *NumPy* ou uma especialização de um dicionário *Python*. Vamos agora dar uma olhada em cada uma dessas perspectivas.

## DataFrame como uma matriz NumPy generalizada

Se um Series é um análogo de uma matriz unidimensional com índices flexíveis, um DataFrame é um análogo de uma matriz bidimensional com índices de linha flexíveis e nomes de coluna flexíveis. Assim como podemos pensar em uma matriz bidimensional como uma sequência ordenada de colunas unidimensionais alinhadas, podemos pensar em um DataFrame como uma sequência de objetos Series alinhados. Aqui, por "alinhado" queremos dizer que eles compartilham o mesmo índice.

 Para demonstrar isso, vamos primeiro construir uma nova série listando a área de cada um dos cinco estados discutidos pouco acima:

In [14]:
area_dict = {'São Paulo': 248209,
                  'Rio de Janeiro': 43696,
                  'Brasilia': 5802,
                  'Salvador': 6938,
                  'Fortaleza': 148826}

area = pd.Series(area_dict)
area

São Paulo         248209
Rio de Janeiro     43696
Brasilia            5802
Salvador            6938
Fortaleza         148826
dtype: int64

In [24]:
# Criando um dataframe

stats = pd.DataFrame({'Population':population, 'Area':area})
stats

                Population    Area
São Paulo         12252023  248209
Rio de Janeiro     6718932   43696
Brasilia           3015268    5802
Salvador           2872347    6938
Fortaleza          2669342  148826

In [25]:
stats['Densidade'] = stats['Area'] / stats['Population']
stats

                Population    Area  Densidade
São Paulo         12252023  248209   0.020259
Rio de Janeiro     6718932   43696   0.006503
Brasilia           3015268    5802   0.001924
Salvador           2872347    6938   0.002415
Fortaleza          2669342  148826   0.055754

In [26]:
stats.loc[stats.Densidade > 0.02, ['Densidade']]

           Densidade
São Paulo   0.020259
Fortaleza   0.055754

In [33]:
stats.iloc[3,2] = 60
stats

                Population    Area  Densidade
São Paulo         12252023      60  60.000000
Rio de Janeiro     6718932   43696  60.000000
Brasilia           3015268    5802   0.001924
Salvador           2872347    6938  60.000000
Fortaleza          2669342  148826   0.055754

In [34]:
np.sin(stats * np.pi /4)

                  Population          Area     Densidade
São Paulo      -7.071068e-01  5.389684e-15  5.389684e-15
Rio de Janeiro  1.097527e-10 -8.972677e-13  5.389684e-15
Brasilia        1.781886e-10  1.000000e+00  1.511268e-03
Salvador        7.071068e-01  1.000000e+00  5.389684e-15
Fortaleza      -1.000000e+00  1.000000e+00  4.377495e-02

In [35]:
np.min(stats)

0.0019242070688243963

In [36]:
stats.min()

Population    2.669342e+06
Area          6.000000e+01
Densidade     1.924207e-03
dtype: float64

In [37]:
# Dataframe através do dicionário

data = {'Pais':['Belgica','India','Brasil'],
       'Capital':['Bruxelas','Nova Delphi', 'Brasilia'],
       'População': [123456, 345675, 125674]}
data

{'Pais': ['Belgica', 'India', 'Brasil'],
 'Capital': ['Bruxelas', 'Nova Delphi', 'Brasilia'],
 'População': [123456, 345675, 125674]}

In [45]:
df = pd.DataFrame(data, columns=['Pais','Capital', 'População'])
df

      Pais      Capital  População
0  Belgica     Bruxelas     123456
1    India  Nova Delphi     345675
2   Brasil     Brasilia     125674

In [46]:
df.set_index('Pais')

             Capital  População
Pais
Belgica     Bruxelas     123456
India    Nova Delphi     345675
Brasil      Brasilia     125674

In [47]:
df.columns

Index(['Pais', 'Capital', 'População'], dtype='object')

In [48]:
df['Pais']

0    Belgica
1      India
2     Brasil
Name: Pais, dtype: object

In [49]:
# Inserindo valores na Sereis do Dataframe

df.insert(3, 'Dimensão',[300,600,900])
df

      Pais      Capital  População  Dimensão
0  Belgica     Bruxelas     123456       300
1    India  Nova Delphi     345675       600
2   Brasil     Brasilia     125674       900

In [50]:
Tamanho = pd.Series([])

for i in range(len(df)):
    if df['Pais'][i] == 'Belgica':
        Tamanho[i] = "Pequeno"
    elif df['Pais'][i] == 'India':
        Tamanho[i] = 'Medio'
    elif df['Pais'][i] == 'Brasil':
        Tamanho[i] = 'Grande'
    else:
        Tamanho[i] = df['Pais'][i]

Tamanho

0    Pequeno
1      Medio
2     Grande
dtype: object

In [51]:
# Criando a nova coluna

df.insert(4, 'Tamanho', Tamanho)
df

      Pais      Capital  População  Dimensão  Tamanho
0  Belgica     Bruxelas     123456       300  Pequeno
1    India  Nova Delphi     345675       600    Medio
2   Brasil     Brasilia     125674       900   Grande

In [56]:
# Inserir uma nova linha

df.append({'Pais':'Argentina', 'Capital':'Buenos Aires', 'População': 400000, 'Dimensão':144000,'Tamanho':'Grande'}, ignore_index=True)

AttributeError: 'DataFrame' object has no attribute 'append'

In [53]:
df

      Pais      Capital  População  Dimensão  Tamanho
0  Belgica     Bruxelas     123456       300  Pequeno
1    India  Nova Delphi     345675       600    Medio
2   Brasil     Brasilia     125674       900   Grande

In [54]:
dic = ({'Pais':'Argentina', 'Capital':'Buenos Aires', 'População': 400000, 'Dimensão':144000,'Tamanho':'Grande'})

In [55]:
df = df.append(dic, ignore_index=True)
df

AttributeError: 'DataFrame' object has no attribute 'append'

In [57]:
# Criando regra para definir classes

def define_class(val):
    if val == 'Grande':
        return 1
    elif val == 'Medio':
        return 2
    elif val == 'Pequeno':
        return 3
    else:
        return 'Classe não encontrada!'

In [58]:
df['Tamanho']

0    Pequeno
1      Medio
2     Grande
Name: Tamanho, dtype: object

In [59]:
# Criando uma nova coluna

df['Classe'] = df['Tamanho'].map(define_class)
df

      Pais      Capital  População  Dimensão  Tamanho  Classe
0  Belgica     Bruxelas     123456       300  Pequeno       3
1    India  Nova Delphi     345675       600    Medio       2
2   Brasil     Brasilia     125674       900   Grande       1

In [60]:
df['Tamanho']

0    Pequeno
1      Medio
2     Grande
Name: Tamanho, dtype: object

In [61]:
df.shape

(3, 6)

In [62]:
# Podemos criar um Dataframe através de looping

num = range(1,6)
val2 = [x * 2 for x in num]
val3 = [x * 3 for x in num]
val4 = [x * 4 for x in num]
val5 = [x * 5 for x in num]

data = [num, val2, val3, val4, val5]
data

[range(1, 6),
 [2, 4, 6, 8, 10],
 [3, 6, 9, 12, 15],
 [4, 8, 12, 16, 20],
 [5, 10, 15, 20, 25]]

In [69]:
# Criando o Dataframe

df1 = pd.DataFrame(data, index=['v', 'w', 'x', 'y', 'z'], columns=['A', 'B', 'C', 'D', 'E'])
df1

   A   B   C   D   E
v  1   2   3   4   5
w  2   4   6   8  10
x  3   6   9  12  15
y  4   8  12  16  20
z  5  10  15  20  25

In [70]:
img = np.arange(49).reshape((7,7))
img

array([[ 0,  1,  2,  3,  4,  5,  6],
       [ 7,  8,  9, 10, 11, 12, 13],
       [14, 15, 16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25, 26, 27],
       [28, 29, 30, 31, 32, 33, 34],
       [35, 36, 37, 38, 39, 40, 41],
       [42, 43, 44, 45, 46, 47, 48]])

In [71]:
img = pd.DataFrame(img, index=[1,2,3,4,5,6,7], columns=['A', 'B', 'C','D','E','F','G'])
img

    A   B   C   D   E   F   G
1   0   1   2   3   4   5   6
2   7   8   9  10  11  12  13
3  14  15  16  17  18  19  20
4  21  22  23  24  25  26  27
5  28  29  30  31  32  33  34
6  35  36  37  38  39  40  41
7  42  43  44  45  46  47  48

In [73]:
img.rename(columns={'A':'aaa', 'C':'ccc', 'E':'eee'}, inplace=True)
img

   aaa   B  ccc   D  eee   F   G
1    0   1    2   3    4   5   6
2    7   8    9  10   11  12  13
3   14  15   16  17   18  19  20
4   21  22   23  24   25  26  27
5   28  29   30  31   32  33  34
6   35  36   37  38   39  40  41
7   42  43   44  45   46  47  48

In [74]:
img

   aaa   B  ccc   D  eee   F   G
1    0   1    2   3    4   5   6
2    7   8    9  10   11  12  13
3   14  15   16  17   18  19  20
4   21  22   23  24   25  26  27
5   28  29   30  31   32  33  34
6   35  36   37  38   39  40  41
7   42  43   44  45   46  47  48

In [75]:
img[['aaa','eee', 'F']]

   aaa  eee   F
1    0    4   5
2    7   11  12
3   14   18  19
4   21   25  26
5   28   32  33
6   35   39  40
7   42   46  47

## Index com: loc e iloc


Esses *slicing* e indexação geralmente são uma fonte de confusão. Por exemplo, vamos utilizar a primeira Série dessa nossa aula, com o nome **s**, se essa Série tem um índice inteiro explícito, uma operação de indexação como s[1] usará os índices explícitos, enquanto uma operação de divisão como s[1:3] usará o índice implícito no estilo Python.

In [76]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [77]:
s[1]

/tmp/ipykernel_5665/878419959.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[1]

-5

In [78]:
s[1:3]

b   -5
c    7
dtype: int64

## Primeiro o atributo loc, que permite indexação e divisão fazendo sempre referência ao indice

In [79]:
img.loc[1:3]

   aaa   B  ccc   D  eee   F   G
1    0   1    2   3    4   5   6
2    7   8    9  10   11  12  13
3   14  15   16  17   18  19  20

In [80]:
img

   aaa   B  ccc   D  eee   F   G
1    0   1    2   3    4   5   6
2    7   8    9  10   11  12  13
3   14  15   16  17   18  19  20
4   21  22   23  24   25  26  27
5   28  29   30  31   32  33  34
6   35  36   37  38   39  40  41
7   42  43   44  45   46  47  48

In [81]:
img2 = img[img.loc[:2,:]%2 == 0]
img2

   aaa    B  ccc     D  eee     F    G
1  0.0  NaN  2.0   NaN  4.0   NaN  6.0
2  NaN  8.0  NaN  10.0  NaN  12.0  NaN
3  NaN  NaN  NaN   NaN  NaN   NaN  NaN
4  NaN  NaN  NaN   NaN  NaN   NaN  NaN
5  NaN  NaN  NaN   NaN  NaN   NaN  NaN
6  NaN  NaN  NaN   NaN  NaN   NaN  NaN
7  NaN  NaN  NaN   NaN  NaN   NaN  NaN

In [82]:
# Slice com loc
img.loc[:,'aaa':'ccc']%2 == 0

     aaa      B    ccc
1   True  False   True
2  False   True  False
3   True  False   True
4  False   True  False
5   True  False   True
6  False   True  False
7   True  False   True

## O atributo iloc permite indexação e divisão que sempre faz referência ao índice implícito no estilo Python

In [83]:
img

   aaa   B  ccc   D  eee   F   G
1    0   1    2   3    4   5   6
2    7   8    9  10   11  12  13
3   14  15   16  17   18  19  20
4   21  22   23  24   25  26  27
5   28  29   30  31   32  33  34
6   35  36   37  38   39  40  41
7   42  43   44  45   46  47  48

In [88]:
img.iloc[1:3]

   aaa   B  ccc   D  eee   F   G
2    7   8    9  10   11  12  13
3   14  15   16  17   18  19  20

In [89]:
img[1:3]

   aaa   B  ccc   D  eee   F   G
2    7   8    9  10   11  12  13
3   14  15   16  17   18  19  20

In [90]:
img.iloc[1:3,1:3]

    B  ccc
2   8    9
3  15   16

In [91]:
img.iloc[:, 0:3]

   aaa   B  ccc
1    0   1    2
2    7   8    9
3   14  15   16
4   21  22   23
5   28  29   30
6   35  36   37
7   42  43   44

## Continuando com Dataframe

In [92]:
!ls

Carros.csv	  Pandas_introducao.ipynb  Pandas-Respostas.ipynb
dados_vendas.csv  pandas.png		   Pandas-Respostas.pdf

In [93]:
data = pd.read_csv('Carros.csv', sep=';')
data.head()

,Consumo,Cilindros,Cilindradas,RelEixoTraseiro,Peso,Tempo,TipoMotor,Transmissao,Marchas,Carburadors,HP
0,21,6,160,39,262,1646,0,1,4,4,110
1,21,6,160,39,2875,1702,0,1,4,4,110
2,228,4,108,385,232,1861,1,1,4,1,93
3,214,6,258,308,3215,1944,1,0,3,1,110
4,187,8,360,315,344,1702,0,0,3,2,175

In [94]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Consumo          32 non-null     int64
 1   Cilindros        32 non-null     int64
 2   Cilindradas      32 non-null     int64
 3   RelEixoTraseiro  32 non-null     int64
 4   Peso             32 non-null     int64
 5   Tempo            32 non-null     int64
 6   TipoMotor        32 non-null     int64
 7   Transmissao      32 non-null     int64
 8   Marchas          32 non-null     int64
 9   Carburadors      32 non-null     int64
 10  HP               32 non-null     int64
dtypes: int64(11)
memory usage: 2.9 KB

In [95]:
data.describe()

,Consumo,Cilindros,Cilindradas,RelEixoTraseiro,Peso,Tempo,TipoMotor,Transmissao,Marchas,Carburadors,HP
count,32.000000,32.000000,32.00000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.0000,32.000000
mean,177.562500,6.187500,796.34375,318.031250,1257.781250,969.812500,0.437500,0.406250,3.687500,2.8125,146.687500
std,84.013032,1.785922,794.53588,122.424825,1534.370076,832.550122,0.504016,0.498991,0.737804,1.6152,68.562868
min,15.000000,4.000000,79.00000,3.000000,22.000000,18.000000,0.000000,0.000000,3.000000,1.0000,52.000000
25%,146.000000,4.000000,290.25000,307.000000,318.500000,173.750000,0.000000,0.000000,3.000000,2.0000,96.500000
50%,179.500000,6.000000,420.00000,338.500000,365.000000,885.000000,0.000000,0.000000,4.000000,2.0000,123.000000
75%,218.250000,8.000000,1201.50000,392.000000,1860.000000,1752.000000,1.000000,1.000000,4.000000,4.0000,180.000000
max,339.000000,8.000000,2758.00000,493.000000,5424.000000,2022.000000,1.000000,1.000000,5.000000,8.0000,335.000000

In [96]:
data.shape

(32, 11)

In [97]:
# Criando mascaras

mask = data.Cilindradas > 500
mask

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14    False
15    False
16    False
17     True
18     True
19     True
20     True
21    False
22    False
23    False
24    False
25    False
26     True
27     True
28    False
29    False
30    False
31    False
Name: Cilindradas, dtype: bool

In [100]:
n2 = data[mask]
n2

,Consumo,Cilindros,Cilindradas,RelEixoTraseiro,Peso,Tempo,TipoMotor,Transmissao,Marchas,Carburadors,HP
7,244,4,1467,369,319,20,1,0,4,2,62
8,228,4,1408,392,315,229,1,0,4,2,95
9,192,6,1676,392,344,183,1,0,4,4,123
10,178,6,1676,392,344,189,1,0,4,4,123
11,164,8,2758,307,407,174,0,0,3,3,180
12,173,8,2758,307,373,176,0,0,3,3,180
13,152,8,2758,307,378,18,0,0,3,3,180
17,324,4,787,408,22,1947,1,1,4,1,66
18,304,4,757,493,1615,1852,1,1,4,2,52
19,339,4,711,422,1835,199,1,1,4,1,65
20,215,4,1201,37,2465,2001,1,0,3,1,97
26,26,4,1203,443,214,167,0,1,5,2,91
27,304,4,951,377,1513,169,1,1,5,2,113

In [101]:
data[(data['Consumo'] < 100) & (data['Cilindros'] == 4)]

,Consumo,Cilindros,Cilindradas,RelEixoTraseiro,Peso,Tempo,TipoMotor,Transmissao,Marchas,Carburadors,HP
26,26,4,1203,443,214,167,0,1,5,2,91

In [102]:
data.head()

,Consumo,Cilindros,Cilindradas,RelEixoTraseiro,Peso,Tempo,TipoMotor,Transmissao,Marchas,Carburadors,HP
0,21,6,160,39,262,1646,0,1,4,4,110
1,21,6,160,39,2875,1702,0,1,4,4,110
2,228,4,108,385,232,1861,1,1,4,1,93
3,214,6,258,308,3215,1944,1,0,3,1,110
4,187,8,360,315,344,1702,0,0,3,2,175

In [105]:
data.Marchas = data.Marchas.astype(float)
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Consumo          32 non-null     int64
 1   Cilindros        32 non-null     int64
 2   Cilindradas      32 non-null     int64
 3   RelEixoTraseiro  32 non-null     int64
 4   Peso             32 non-null     int64
 5   Tempo            32 non-null     int64
 6   TipoMotor        32 non-null     int64
 7   Transmissao      32 non-null     int64
 8   Marchas          32 non-null     float64
 9   Carburadors      32 non-null     int64
 10  HP               32 non-null     int64
dtypes: float64(1), int64(10)
memory usage: 2.9 KB

In [106]:
# Alteração de valores no Dataframe

data.at[0,'Marchas'] = 5.7
data.head()

,Consumo,Cilindros,Cilindradas,RelEixoTraseiro,Peso,Tempo,TipoMotor,Transmissao,Marchas,Carburadors,HP
0,21,6,160,39,262,1646,0,1,5.7,4,110
1,21,6,160,39,2875,1702,0,1,4.0,4,110
2,228,4,108,385,232,1861,1,1,4.0,1,93
3,214,6,258,308,3215,1944,1,0,3.0,1,110
4,187,8,360,315,344,1702,0,0,3.0,2,175

In [107]:
data.iat[4,8] = 5
data.head()

,Consumo,Cilindros,Cilindradas,RelEixoTraseiro,Peso,Tempo,TipoMotor,Transmissao,Marchas,Carburadors,HP
0,21,6,160,39,262,1646,0,1,5.7,4,110
1,21,6,160,39,2875,1702,0,1,4.0,4,110
2,228,4,108,385,232,1861,1,1,4.0,1,93
3,214,6,258,308,3215,1944,1,0,3.0,1,110
4,187,8,360,315,344,1702,0,0,5.0,2,175

In [108]:
data.loc[0,['Cilindradas','Peso']] = (130, 200)
data.head()

,Consumo,Cilindros,Cilindradas,RelEixoTraseiro,Peso,Tempo,TipoMotor,Transmissao,Marchas,Carburadors,HP
0,21,6,130,39,200,1646,0,1,5.7,4,110
1,21,6,160,39,2875,1702,0,1,4.0,4,110
2,228,4,108,385,232,1861,1,1,4.0,1,93
3,214,6,258,308,3215,1944,1,0,3.0,1,110
4,187,8,360,315,344,1702,0,0,5.0,2,175

In [109]:
data.iloc[1,1] = 4
data.head()

,Consumo,Cilindros,Cilindradas,RelEixoTraseiro,Peso,Tempo,TipoMotor,Transmissao,Marchas,Carburadors,HP
0,21,6,130,39,200,1646,0,1,5.7,4,110
1,21,4,160,39,2875,1702,0,1,4.0,4,110
2,228,4,108,385,232,1861,1,1,4.0,1,93
3,214,6,258,308,3215,1944,1,0,3.0,1,110
4,187,8,360,315,344,1702,0,0,5.0,2,175

In [110]:
data.loc[:,'Carburadors':'HP'] = None
data.head()

/tmp/ipykernel_5665/2532919977.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'None' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  data.loc[:,'Carburadors':'HP'] = None
/tmp/ipykernel_5665/2532919977.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'None' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  data.loc[:,'Carburadors':'HP'] = None

,Consumo,Cilindros,Cilindradas,RelEixoTraseiro,Peso,Tempo,TipoMotor,Transmissao,Marchas,Carburadors,HP
0,21,6,130,39,200,1646,0,1,5.7,None,None
1,21,4,160,39,2875,1702,0,1,4.0,None,None
2,228,4,108,385,232,1861,1,1,4.0,None,None
3,214,6,258,308,3215,1944,1,0,3.0,None,None
4,187,8,360,315,344,1702,0,0,5.0,None,None

In [111]:
data.loc[:,'Carburadors':'HP'] = (1, 130)
data.head()

,Consumo,Cilindros,Cilindradas,RelEixoTraseiro,Peso,Tempo,TipoMotor,Transmissao,Marchas,Carburadors,HP
0,21,6,130,39,200,1646,0,1,5.7,1,130
1,21,4,160,39,2875,1702,0,1,4.0,1,130
2,228,4,108,385,232,1861,1,1,4.0,1,130
3,214,6,258,308,3215,1944,1,0,3.0,1,130
4,187,8,360,315,344,1702,0,0,5.0,1,130

In [112]:
data.describe()

,Consumo,Cilindros,Cilindradas,RelEixoTraseiro,Peso,Tempo,TipoMotor,Transmissao,Marchas
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000
mean,177.562500,6.125000,795.406250,318.031250,1255.843750,969.812500,0.437500,0.406250,3.803125
std,84.013032,1.827214,795.328249,122.424825,1535.706607,832.550122,0.504016,0.498991,0.835690
min,15.000000,4.000000,79.000000,3.000000,22.000000,18.000000,0.000000,0.000000,3.000000
25%,146.000000,4.000000,290.250000,307.000000,318.500000,173.750000,0.000000,0.000000,3.000000
50%,179.500000,6.000000,420.000000,338.500000,365.000000,885.000000,0.000000,0.000000,4.000000
75%,218.250000,8.000000,1201.500000,392.000000,1860.000000,1752.000000,1.000000,1.000000,4.000000
max,339.000000,8.000000,2758.000000,493.000000,5424.000000,2022.000000,1.000000,1.000000,5.700000